from random import randint
pc=randint(1,3)


print "1) Πέτρα"
print "2) Ψαλίδι"
print "3) Χαρτί"

ch=input("Διάλεξε : ")

if (ch==1 and pc==1):
    print "Ισοπαλία"
    print "Η Επιλογή σου είναι : Πέτρα"
    print "Η Επιλογή του υπολογιστή είναι : Πέτρα"
    
elif (ch==1 and pc==2):
    print "Νίκησες"
    print "Η Επιλογή σου είναι : Πέτρα"
    print "Η Επιλογή του υπολογιστή είναι : Ψαλίδι"

elif (ch==1 and pc==3):
    print "Έχασες"
    print "Η Επιλογή σου είναι : Πέτρα"
    print "Η Επιλογή του υπολογιστή είναι : Χαρτί"

elif (ch==2 and pc==1):
    print "Έχασες"
    print "Η Επιλογή σου είναι : Ψαλίδι"
    print "Η Επιλογή του υπολογιστή είναι : Πέτρα"
    
elif (ch==2 and pc==2):
    print "Ισοπαλία"
    print "Η Επιλογή σου είναι : Ψαλίδι"
    print "Η Επιλογή του υπολογιστή είναι : Ψαλίδι"

elif (ch==2 and pc==3):
    print "Νίκησες"
    print "Η Επιλογή σου είναι : Ψαλίδι"
    print "Η Επιλογή του υπολογιστή είναι : Χαρτί"

elif (ch==3 and pc==1):
    print "Νίκησες"
    print "Η Επιλογή σου είναι : Χαρτί"
    print "Η Επιλογή του υπολογιστή είναι : Πέτρα"
    
elif (ch==3 and pc==2):
    print "Έχασες"
    print "Η Επιλογή σου είναι : Χαρτί"
    print "Η Επιλογή του υπολογιστή είναι : Ψαλίδι"

elif (ch==3 and pc==3):
    print "Ισοπαλία"
    print "Η Επιλογή σου είναι : Χαρτί"
    print "Η Επιλογή του υπολογιστή είναι : Χαρτί"

else:
    print "Wrong Number"
